# TrussElementCreateBottomParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussElementCreateBottomParam Property
ParameterTypeId Class See Also
---
"Create Bottom Chord"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussElementCreateBottomParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussElementCreateBottomParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussElementCreateBottomParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace